import 'package:flutter/material.dart';

class CreateAgreement extends StatelessWidget {
  final String pdfText =
      """Соглашение об оказании услуг по содействию в привлечении специалистов для проведения маркетинговых исследовании

Общество с ограниченной ответственностью «НИКА» (ИНН 2311318142, ОГРН 1212300022175), размещением настоящей Оферты на Сайте https://feedback24.ru предлагает физическим лицам /Самозанятым / ИП заключить Договор на условиях, изложенных в настоящей Оферте.

Безусловным принятием (акцептом) условий настоящей оферты считается регистрация на сайте https://feedback24.ru (п.1.1. Соглашения) или направленных на использование функционала Сайта ООО «НИКА», в том числе через приложение или установку приложения «Feedback24-Тайный покупатель» на мобильное устройство пользователей.

Акцепт настоящей оферты (Соглашения) на иных условиях, отличных от тех, что указаны в настоящей оферте, либо акцепт под условием, не допускается.

1. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ
1.1 Сервис —  интерактивный программный комплекс,  включая веб-сайт, расположенный в сети Интернет по уникальному адресу https://feedback24.ru, а также мобильное приложение «Feedback24-Тайный покупатель». Используется для размещения запросов на оказание Услуг Пользователями.

1.2 Оферта — настоящий документ, "Дополнительные условия оказания услуг в Сервисе", размещенный в Интернете по адресу https://feedback24.ru, включая все документы, указанные в данной Оферте.

1.3 Услуги — услуги, связанные с выполнением заданий, доступных Пользователю на Сервисе. Маркетинговое исследование, проводимое по методу Mistery shopping, направленное на оценку потребительского опыта, полученного клиентом в процессе приобретения товара или услуги, так и с целью решения организационных задач, например, измерения уровня соблюдения стандартов обслуживания клиентов сотрудниками организации.

1.4 Пользователь — физическое лицо/ИП/Самозанятым, зарегистрированное и осуществившее акцепт Оферты и оказывающее/заказывающее услуги на Сервисе.

1.5 Исполнитель — физическое лицо, зарегистрированное в качестве Самозанятого (либо остаётся не самозанятым), осуществившее акцепт Оферты и оказывающее услуги на Сервисе в порядке, предусмотренные п. 3.2.2 настоящей Оферты и Политикой конфиденциальности.

1.6 Заказчик — физическое/юридическое лицо, зарегистрированное с целью получения Услуг.

1.7 Акцепт Оферты — полный и безоговорочный акцепт Оферты путем выполнения действий, предусмотренных п. 3.2 настоящей Оферты, что подразумевает безоговорочное принятие всех условий, предусмотренных настоящей Офертой и документами, на которые Оферта ссылается.

1.8 Договор — договор о дополнительных условиях оказания Услуг в сервисе «Feedback24» между Пользователем и сервисом, который заключается путем Акцепта Оферты.

1.9 Интерфейс — программный интерфейс, предназначенный для удаленного взаимодействия Сторон в рамках Договора, который содержит информацию о Пользователе («Пользовательские данные»), информацию касательно размера вознаграждения Пользователя, иную информацию, доступный Пользователю после авторизации с использованием логина и пароля Исполнителя на Сервисе

1.10 Самозанятый — гражданин Российской Федерации, зарегистрированный в качестве Самозанятого, в соответствии с Федеральным Законом №422-ФЗ и оказывающий услуги на территория любого из субъектов Российской Федерации, в которых введен в действие специальный налоговый режим "Налог на профессиональный доход".

1.11 Конфиденциальная Информация — любая информация (научно-техническая, технологическая, производственная, финансово-экономическая или иная, в том числе, но не ограничиваясь этим, о средствах защиты информации и идентификации/аутентификации, авторизации (логинах, паролях и т.д.), статистическая информация, персональные данные, информация о клиентах, о продуктах, услугах и т.д.), передаваемая одной Стороной другой Стороне в любой возможной форме (устной, письменной, электронной, иной), которая имеет действительную или потенциальную коммерческую ценность в силу неизвестности ее третьим лицам, к которой нет свободного доступа на законном основании и обозначенная в заданиях на Сайте как конфиденциальная.

В Оферте могут быть использованы термины, не определенные выше. В этом случае толкование такого термина производится в соответствии с текстом Оферты. В случае отсутствия однозначного толкования термина в тексте Оферты следует руководствоваться толкованием термина, определенным: в первую очередь — Условиями, затем - действующим законодательством, затем - сложившимся (общеупотребимым) в сети Интернет.

2. ПРЕДМЕТ СОГЛАШЕНИЯ
2.1. Принимая условия настоящей Оферты, Исполнитель соглашается оказать Заказчику Услуги, а Заказчик обязуется принять и оплатить следующие Услуги: Маркетинговые исследования по методу Mystery shopping (далее – «Услуги»), согласно цене, определяемой Сервисом и отображаемой в Интерфейсе.

2.2. Исполнитель оказывает Услуги лично. Привлечение третьих лиц к оказанию Услуг невозможно.

2.3. Место оказания Услуг устанавливается Сервисом и отображается в Интерфейсе с указанием геолокации на карте и точного адреса.

2.4. Срок оказания Услуг устанавливается Заказчиком и отображается в Интерфейсе.

3. УСЛОВИЯ И ПОРЯДОК ИСПОЛНЕНИЯ СОГЛАШЕНИЯ
3.1. Принятие и соблюдение Пользователем требований и положений, предусмотренных настоящей Офертой, а также в Условиях и других документах, указанных в Оферте, является обязательным условием оказания Услуг.

3.2. В случае регистрации Пользователя в качестве Самозанятого, Пользователь приступает к дальнейшему оказанию Услуг только после выполнения всех нижеперечисленных условий:

3.2.1. Пользователь вошел в свою учетную запись на Сайте в порядке, предусмотренном Условиями.

3.2.2. Пользователь выполнил Акцепт Оферты и в обязательном порядке предоставил необходимые данные в конце формы в Интерфейсе.

3.2.3. Пользователь проверил и подтвердил подлинность данных, введенных в профиле Пользователя и включающих в себя полное имя, фамилию, электронный адрес, а также указал подлинные отчество, номер мобильного телефона, паспортные данные, номер ИНН.

3.2.4. Пользователь подтвердил свой номер телефона на сайте путем ввода кода, высылаемого Сервисом автоматически.

3.2.5. Пользователь предоставил по запросу Заказчика следующую информацию и/или документы:

(1) фотографии страниц паспорта гражданина Российской Федерации или иного документа, удостоверяющего личность Пользователя в государстве, указанном Пользователем в качестве страны гражданства или постоянного проживания, содержащих личные сведения о Пользователе и сведения об адресе регистрации Пользователя,

(2) иную информацию и/или документы, обоснованно необходимые Заказчику для исполнения Договора.

3.3. Сервис также вправе отказать Пользователю в заключении нового Договора в случае, если ранее Договор был расторгнут с Пользователем по любому из оснований, указанному в п. 9.1 настоящей Оферты.

3.4. Пользователь гарантирует, что:

3.5.1. Оказание Услуг Пользователем не противоречит законодательству, либо обязательствам Пользователя перед третьими лицами, и что оказание Услуг никоим образом не нарушает прав и законных интересов третьих лиц;

3.5.2. Пользователь выполняет задания в полном соответствии с Условиями описанными Сервисом;

3.5.3. Пользователь предоставил сервису полную, достоверную и актуальную информацию, предусмотренную Условиями и настоящей Офертой.

3.6. Самозанятые вправе использовать Сервис в качестве уполномоченного оператора электронной площадки в рамках эксперимента в соответствии с Федеральным Законом №422-ФЗ от 27.11.2018 для передачи сведений о произведенных расчетах в налоговый орган, формирования чека и обеспечения его передачи Сервису. При этом контроль за передачей сведений о произведенных расчетах в налоговый орган, формированием чека и обеспечения его передачи Сервису осуществляется непосредственно Самозанятым посредством мобильного приложения «Мой налог».

3.7. По факту оказания Услуг Пользователь представляет сервису на подписание акт сдачи-приемки оказанных услуг в двух экземплярах.

3.8. В течение 5 календарных дней после получения Акта сдачи-приемки оказанных Услуг Заказчик обязан принять услуги, подписать Акт сдачи-приемки и направить один экземпляр Пользователю, либо, при наличии недостатков, представить Пользователю мотивированный отказ от его подписания. В ином случае Услуги считаются оказанными надлежащим образом и принятыми Заказчиком.

4. ГАРАНТИИ
4.1. За исключением гарантий, прямо указанных в Оферте, Сервис не предоставляет иных явных или подразумеваемых гарантий и прямо отказывается от гарантий или условий в отношении не нарушения прав или ожиданий, связанных с Услугами, или достижимости определенных целей Пользователя.

4.2. Принимая Оферту, Пользователь заверяет и гарантирует Сервису, что:

4.2.1. Пользователь указал действительные и достоверные сведения, включая персональные данные, реквизиты виртуального счета в платежной системе или кредитной организации и прошел процедуру идентификации в ней.

4.2.2. Пользователь a) внимательно ознакомился с полным текстом Оферты, б) полностью понимает предмет Оферты и Договора, в) полностью понимает значение и последствия своих действий по заключению и исполнению Договора.

4.2.3. Содержание информации, предоставляемой пользователем в ходе оказания Услуг, не нарушает действующее законодательство и права третьих лиц.

5. ИНФОРМАЦИОННАЛЬНАЯ БЕЗОПАСНОСТЬ САЙТА
5.1. Используя Сайт, Пользователь обязуется не нарушать или пытаться нарушать информационную безопасность Сайта, что включает в себя:

5.1.1. доступ к данным, не предназначенным для данного Пользователь или вход в систему под логином, не принадлежащем данному Соискателю;

5.1.2. попытки проверить уязвимость системы безопасности Сайта, нарушение процедуры регистрации и авторизации без разрешения Исполнителя;

5.1.3. попытки создать помехи в использовании Сайта другим пользователям, что включает в себя распространение компьютерных вирусов, порчу данных, постоянную рассылку повторяющейся информации, пересылку электронной почты через сервер сайта, одновременную отправку большого количества электронной почты и/или запросов к Сайту с целью намеренно вывести сервер сайта из строя и тому подобные действия, выходящие за рамки нормального целевого использования Сайта, и могущие умышленно или по неосторожности повлечь сбои в его работе;

5.1.4. рассылку пользователям Сайта материалов, на которые они не давали своего согласия, «спама», любых писем и рекламы без разрешения Пользователя;

5.1.5. имитацию и/или подделку любого заголовка пакета TCP/IP или любой части заголовка в любом электронном письме или размещенном на Сайте материале;

5.1.6. использование или попытки использования любого программного обеспечения, или процедуры для навигации или поиску на Сайте, кроме встроенной в Сайт поисковой машины и традиционных и общедоступных браузеров (Microsoft Explorer, Mozilla Firefox и других подобных).

5.1.7. использование программных средств, имитирующих работу Пользователя на Сайте, в т.ч. в приложении Исполнителя.

5.2. Нарушение Пользователем безопасности системы или компьютерной сети или попыток ее нарушить влечет за собой гражданскую и уголовную ответственность. Исполнитель будет расследовать все случаи возможного нарушения безопасности или попыток ее нарушить со стороны всех пользователей Сайта в сотрудничестве с правоохранительными органами с целью пресечения подобной злонамеренной деятельности.

6. ЗАЩИЩЕННЫЕ РАЗДЕЛЫ САЙТА И ПАРОЛИ
6.1. Доступ к информации, находящейся на защищенных разделах Сайта разрешен только зарегистрированным пользователям, получившим пароль для входа на защищенные разделы Сайта. Пароль не может передаваться другим лицам, и Соискатель полностью несет ответственность за весь ущерб, причиненный ему, Исполнителю или третьим лицам, возникший вследствие намеренной или ненамеренной передачи Соискателем пароля другому лицу. Соискатель несет ответственность за сохранение конфиденциальности пароля и любое использование Сайта посредством его пароля.

7. ОТВЕТСТВЕННОСТЬ И ОГРАНИЧЕНИЕ ОТВЕТСТВЕННОСТИ
7.1. Настоящая Оферта и Договор регулируются и толкуются в соответствии с законодательством Российской Федерации. Все споры, возникающие из или в связи с настоящей Офертой, Договором и/или Условиями, подлежат разрешению путем переговоров, а в случае недостижения согласия - в суде общей юрисдикции по месту нахождения Сервиса. Вышеизложенное не ограничивает право Сервиса обращаться в любые другие судебные органы за судебным запретом и (или) любыми иными мерами правовой защиты.

7.2. Ни при каких обстоятельствах Сервис не несет ответственности по Договору за: a) косвенные убытки и/или упущенную выгоду Пользователя или третьих лиц, независимо от способности Заказчика предвидеть возможность возникновения таких убытков и/или упущенной выгоды; б) отсутствие у Пользователя возможности доступа к Сервису и/или наличие сбоев в сети Интернет.

7.3. Стороны не несут ответственности за частичное или полное неисполнение обязательств по Договору, если такое неисполнение происходит вследствие обстоятельств непреодолимой силы (форс-мажор), которые возникают после заключения Договора, или если неисполнение Сторонами обязательств по Договору стало следствием чрезвычайных обстоятельств, которые Стороны не могли предвидеть или предотвратить с помощью разумных мер.

7.4. Пользователь полностью несет ответственность за a) соблюдение всех требований применимого законодательства при оказании Услуг, б) достоверность и полноту информации, указанной при регистрации и/или при заключении Договора, в) сохранение конфиденциальности всей полученной в ходе оказания Услуг информации.

7.5. В случае нарушения Пользователем положений настоящей Оферты или Условий, Сервис вправе отказаться от исполнения Договора и немедленно расторгнуть Договор в одностороннем внесудебном порядке, при этом Услуги, в отношении которых Сервисом признано такое нарушение, признаются оказанными ненадлежащим образом и оплате Сервисом не подлежат. Договор в таком случае считается расторгнутым с момента направления Сервисом уведомления о расторжении Договора любым из способов, указанных в п. 10.2 Оферты.

7.6. Возникающие из Договора споры разрешаются в досудебном порядке путем направления претензионного письма. Срок рассмотрения претензионного письма составляет 10 рабочих дней с момента получения. В случае, если разрешение спора в досудебном порядке признано Сторонами невозможным, спор подлежит рассмотрению в судебном порядке в соответствии с законодательством Российской Федерации.

8. СРОК ДЕЙСТВИЯ И ИЗМЕНЕНИЕ УСЛОВИЙ ОФЕРТЫ
8.1. Сервис оставляет за собой право в любое время и без предварительного уведомления вносить любые изменения и дополнения в настоящую Оферту. Уведомления о таких изменениях будут заблаговременно направлены Пользователю на адрес электронной почты, указанный Пользователем в личном кабинете, за исключением случаев, если Пользователь отказался от получения уведомлений по электронной почте, а также посредством интерфейса пользовательской учётной записи на Сервисе. Уведомления об изменениях Условий, Политики конфиденциальности и иных применимых документов будут также опубликованы на Сервисе.

8.2. В случае внесения изменений в Оферту и/или Условия Сервисом, такие изменения вступают в силу в момент размещения измененного текста Оферты и/или Условий в Интернете, если при размещении не указывается иная дата вступления таких изменений в силу.

9. СРОК ДЕЙСТВИЯ И ИЗМЕНЕНИЕ УСЛОВИЙ ДОГОВОРА
9.1. Акцепт Оферты Пользователем, выполненный в соответствии с п. 3.2 и п. 3.3 Оферты, создает юридически обязывающий Договор на условиях Оферты.

9.2. Договор вступает в силу с момента акцепта Оферты Пользователем и сохраняет свою силу до расторжения Договора одной из Сторон.

9.3. Пользователь подтверждает и соглашается, что изменения, внесенные в Оферту, влекут за собой внесение таких изменений в Договор, распространяющих свое действие на отношения Сторон, и такие изменения в Договор вступают в силу одновременно с изменениями в Оферту.

10. РАСТОРЖЕНИЕ ДОГОВОРА
10.1. Договор может быть расторгнут:

10.1.1. Пользователем путем обращения в службу Поддержки Сервиса через форму обратной связи с описанием причины расторжения Договора и последующим удалением Учетной записи. Также Пользователь может обратится по адресу электронной почты info@feedback24.ru и по телефону Сервиса 8 800 600-67-06. служба поддержки может запросить подтверждения того, что аккаунт принадлежит Пользователю.

10.1.2. Сервисом в случае, если Пользователь не выполнял задания в Сервисе в течение 36 (тридцати шести) календарных месяцев подряд;

10.1.3. Сервисом в случае, если Пользователь утратил статус самозанятого;

10.1.5. Сервисом в любой момент по любым иным причинам, в том числе, в связи с нарушением Пользователем положений Оферты и/или условий пользования Сервисом, путём направления Пользователю письма по электронной почте и (или) посредством Интерфейса, без объяснения причин расторжения; или

10.1.6. Сервисом или Пользователем по иным основаниям, предусмотренным Офертой и/или применимым законодательством.

10.2. Обязательства Сторон по Договору, которые в силу своего характера должны сохранять свое действие (включая, но не ограничиваясь, обязательствами, касающимися конфиденциальности, порядка оплаты, использования информации, защиты персональных данных и пр.), сохраняют силу после расторжения Договора.

11. ЮРИДИЧЕСКИЕ АДРЕСА И БАНКОВСКИЕ РЕКВИЗИТЫ
Исполнитель: ООО «НИКА» Директор: Щелкунов А. А. Юридический адрес : 350049, г. Краснодар, ул. Красных Партизан 367, оф.605 Фактический адрес : 350049, г. Краснодар, ул. Красных Партизан 367, оф.605 ИНН: 2311318142 КПП: 231101001 ОГРН: 1212300022175 Расчетный счет: 40702810400550000392 К/с: 30101810145250000411 Филиал "ЦЕНТРАЛЬНЫЙ" Банка ВТБ ПАО Г. МОСКВА БИК Банка: 044525411 Телефон для связи: + 7 800 600-67-06 Электронная почта: info@feedback24.ru
""";

  Widget build(BuildContext context) {
    return SafeArea(
        child: Scaffold(
            appBar: AppBar(
              title: const Text(''),
              actions: [
                TextButton(
                    onPressed: () {
                      Navigator.of(context).pop('User Agreed');
                    },
                    child: new Text('Соглашаюсь',
                        style: Theme.of(context)
                            .textTheme
                            .subtitle1!
                            .copyWith(color: Colors.white))),
              ],
            ),
            body: SingleChildScrollView(
              child: Padding(
                padding: const EdgeInsets.all(8.0),
                child: Text(pdfText),
              ),
            )));
  }
}
